<?php
// Menu link
$_['question_menu']     = 'Вопросы о товарах';

// Heading
$_['heading_title']     = 'Вопросы о товарах';

// Text
$_['text_success']      = 'Список вопросов обновлен';
$_['text_list']         = 'Список вопросов';
$_['text_add']          = 'Добавить вопрос';
$_['text_edit']         = 'Редактировать вопрос';
$_['info_private'] 		= '<i class="fa fa-info-circle"></i> <i>Этот вопрос является частным. Автор не хотел его публиковать</i>';
$_['text_answered']     = 'Отвечено';
$_['text_not_answered'] = 'Ожидает ответа';
$_['button_setting']    = 'Настройки';
$_['text_yes']    		= 'Да';
$_['text_no']    		= 'Нет';
$_['text_private']      = 'Приватный';

// Column
$_['column_product']    = 'Товар';
$_['column_author']     = 'Автор';
$_['column_text']     	= 'Вопрос';
$_['column_status']     = 'Опубликовано';
$_['column_info'] 		= 'Отвечено';
$_['column_date_added'] = 'Добавлено';
$_['column_action']     = 'Действие';

// Entry
$_['entry_product']     = 'Товар';
$_['help_product']      = '(Автодополнение)';
$_['entry_author']      = 'Автор';
$_['entry_email']      	= 'Email';
$_['entry_rating']      = 'Рейтинг';
$_['entry_status']      = 'Опубликовано';
$_['entry_text']        = 'Вопрос';
$_['entry_answer']      = 'Ваш Ответ';
$_['entry_notify']      = 'Уведомить автора';
$_['entry_notify_help'] = 'Если эта опция включена, уведомление будет отправлено автору на email.';
$_['entry_date_added']  = 'Добавлено';

// Settings page
$_['entry_global_status']     	= 'Настройки';
$_['help_global_status']      	= 'Если эта опция включена, вопросы можно отправить со страницы товара';
$_['entry_default_status']      = 'Статус вопроса по умолчанию';
$_['help_default_status']      	= 'Установите статус по умолчанию на представленные вопросы. Если включено, то вопросы будут опубликованы без одобрения администратором';
$_['entry_allow_private']      	= 'Разрешить частные вопросы';
$_['help_allow_private']  		= 'Если этот параметр включен, пользователи могут выбрать, чтобы не публикуют вопрос';
$_['entry_questions_per_page']  = 'Вопросы на странице';
$_['help_questions_per_page']   = 'Количество вопросов на странице в магазине';
$_['entry_admin_notify']        = 'Email уведомления';
$_['help_admin_notify']      	= 'Выберите, если вы хотите получать уведомление на email о поступлении вопроса';

// Email notification to Author
$_['text_subject']     			= 'Ответ на вопрос';
$_['text_intro']     			= 'Благодарим Вас за проявленный интерес к нашим товарам. Вот наш ответ на Ваш вопрос:';
$_['text_further_questions']    = 'Если у вас есть дополнительные вопросы, не стесняйтесь связаться с нами, ответив на это письмо';

// Warning
$_['warning_disabled']        = 'Вопросы о продукте отключены глобально. Проверьте настройки, чтобы включить его';

// Error
$_['error_permission']  = 'У Вас нет прав для изменения!';
$_['error_product']     = 'Обязательное поле!';
$_['error_author']      = 'Автор должен быть от 3 до 64 символов!';
$_['error_email']       = 'Email должен быть от 3 до 64 символов!';
$_['error_text']        = 'Вопрос должен быть как минимум из 1 символа!';