<?php

if(!function_exists('getGUID'))
{
		function get_func_argNames($class, $method) {
			$f = new ReflectionFunction($class, $method);
			$result = array();
			foreach ($f->getParameters() as $param) {
				$result[] = $param->name;   
			}
			return $result;
		}
		
		
		function getAllCities($name = 'Казахстан')
		{
			
		$options = array(
			'login' => 'Web2',
			'password' => '231642200',
		);
		$client = new SoapClient('https://tc.avislogistics.kz/workbase/ws/WebServiceRemotePoint.1cws?wsdl', $options);
		$res = $client->SozdatAdresnuyuTochku(array('Login' => 'Пьюр Бьюти', 'Password' => 'dc226569-7b5b-4993-b23c-558300c51b19',
		'AdresnayaTochka' => array(
		
			'Naimenovaniye' => 'kazahstan1',
			'Kod' => uniqid().'_gg',
			'Gorod_GUID' => '089ff227-6362-11e6-80dc-000c298b6ba7',
			'Indeks' => 2284,
			'Ulitsa' => 123456,
			'Dom' => 5554,
			'Korpus' => 'main',
			'KvartiraOfis' => 'Квартира 23',
			'Telefony' => '+7(701)72966154',
			'Dopolnitelno' => ''
		
		)));

		//	print_r(get_func_argNames($client->VernutSpisokYAzykov('Пьюр Бьюти', 'dc226569-7b5b-4993-b23c-558300c51b19', 123)));
		
		$obj = $client->VernutSpisokStran(array('Login' => 'Пьюр Бьюти', 'Password' => 'dc226569-7b5b-4993-b23c-558300c51b19'));
		$strany = $obj->return->Strana;
		$country = false;
		foreach($strany as $s)
		{
			if($s->Naimenovaniye == $name)
			{
				$country = $s;
				break;
				
			}
			
		}
		$obj = $client->VernutSpisokGorodov(array('Login' => 'Пьюр Бьюти', 'Password' => 'dc226569-7b5b-4993-b23c-558300c51b19'));
		$goroda = $obj->return->Gorod;
		$fgoroda = array();
		foreach($goroda as $g)
		{
			if($country->GUID == $g->GUID_Strana)
			{
				$fgoroda[] = $g;
				
			}
			
			
		}
		
		return $fgoroda;
			
			
			
		}
		

function getGUID($city, $country = 'Казахстан'){
		
	
	$fgoroda = getAllCities($country);
	foreach($fgoroda as $g)
	{
		
		if(stripos($city, $g->Naimenovaniye) !== FALSE){
			return $g->GUID;
		}
		
	}
	return false;
}
}
//echo '<pre>';
//print_r(getAllCities('Казахстан'));
//echo '</pre>';
//exit;
//$cities['Основные города'] = $fgoroda;

$default_gorod_guid = 'bb630584-015f-11e4-937a-0025904eff31';
$cities = array();
$cities['Город республиканского значения‎'] = array(

	'Нур-Султан' => 1,
	'Алматы' => 0
);
$cities['Акмолинская область (ч/з Астану)'] = array(
'Акколь' => 3, 
'Астана' => 1, 
'Атбасар' => 3, 
'Аэропорт г. Астана' => 1, 
'Ерейментау' => 3, 
'Есиль' => 5, 
'Державинск' => 3, 
'Степногорск' => 3,
);
$cities['Акмолинская область (ч/з Кокшетау)'] = array(
'Боровое' => 4, 
'Васильковский ГОК' => 2, 
'Зеренда' => 2, 
'Кокшетау' => 1, 
'Коныспай' => 3, 
'Красный Яр' => 3, 
'Макинск' => 4, 
'Щучинск' => 4, 
'Аэропорт г. Кокшетау' => 3,
);
$cities['Актюбинская область'] = array(
'Айке' => 6, 
'Актобе' => 1, 
'Алга' => 3, 
'Байганин' => 6, 
'Батамша' => 5, 
'Иргиз' => 6, 
'Кандыагаш' => 3, 
'Карабутак' => 6, 
'Коктау' => 6, 
'Комсомол' => 5, 
'Косестек' => 6, 
'Мартук' => 3, 
'Темир' => 6, 
'Уил' => 6, 
'Хобда' => 3, 
'Хромтау' => 3, 
'Шалкар' => 6, 
'Шубарши' => 6, 
'Эмба' => 6,
);
$cities['Алматинская область (ч/з Алматы)'] = array(
'Алатау пос.' => 2, 
//'Алматы' => 1, 
'Байсейит' => 7, 
'Байсерке' => 2, 
'Береке' => 2, 
'Боролдай (Бурундай)' => 2, 
'Даулет (Алматинская обл.)' => 4, 
'Жетыген' => 4, 
'Иссык' => 5, 
'Калкаман' => 2, 
'Капчагай' => 4, 
'Каргалы (Фабричный)' => 4, 
'Каскелен' => 2, 
'Ремизовка' => 2, 
'Самсы' => 6, 
'Талгар' => 3, 
'Туймебаева пос.' => 2, 
'Тургень' => 6, 
'Узун-Агаш' => 3, 
'Отеген Батыр' => 2, 
'Чемолган' => 4, 
'Чилик' => 7,
);
$cities['Алматинская область (ч/з Талды-Корган)'] = array(
'Балпык би' => 5, 
'Достык (Дружба)' => 7, 
'Жансугурова' => 6, 
'Жаркент' => 7, 
'Капал' => 6, 
'Карабулак' => 4, 
'Коксу' => 6, 
'Кугалы' => 6, 
'Мамбет' => 6, 
'Матай' => 6, 
'Сарканд' => 6, 
'Сарыозек' => 6, 
'Талдыкорган' => 1, 
'Текели' => 6, 
'Учарал' => 7, 
'Уштобе' => 6, 
'Хоргас' => 7,
);
$cities['Атырауская область'] = array(
'Аккистау' => 6, 
'Атырау' => 1, 
'Балыкшы' => 1, 
'Бирлик пос. (Атырауская обл.)' => 1, 
'Ганюшкино' => 6, 
'Геолог' => 1, 
'Дамба' => 1, 
'Доссор' => 6, 
'Жарсук' => 6, 
'Жумыскер' => 1, 
'Индер' => 6, 
'Каратон' => 7, 
'Кульсары' => 3, 
'Макат' => 6, 
'Махамбет' => 6, 
'Миялы' => 6, 
'Тенгиз' => 6,
);
$cities['Восточно-Казахстанская область (ч/з Семей)'] = array(
'Бородулиха' => 6, 
'Жезкент' => 6, 
'Курчатов' => 6, 
'Семей' => 1,
);
$cities['Восточно-Казахстанская область ( ч/з Усть-Каменогорск)'] = array(
'Аягоз' => 6, 
'Глубокое' => 4, 
'Жангизтобе' => 5, 
'Зайсан' => 4, 
'Зыряновск' => 3, 
'Новая Бухтарма' => 5, 
'Риддер' => 3, 
'Серебрянск' => 5, 
'Тараханка' => 5, 
'Усть-Каменогорск' => 1, 
'Усть-Таловка' => 4, 
'Шемонаиха' => 3,
);
$cities['Жамбылская область'] = array(
'Айша биби' => 4, 
'риддер' => 4, 
'Аса' => 4, 
'Аэропорт г. Тараз' => 2, 
'Бауржан Момышулы' => 4, 
'Бостандык' => 5, 
'Бурыл' => 4, 
'Дихан' => 4, 
'Жамбыл (Жамб. обл.)' => 5, 
'Жанатас' => 5, 
'Каратау' => 5, 
'Коктал' => 5, 
'Кордай' => 4, 
'Кулан' => 4, 
'Луговое' => 4, 
'Мерке' => 5, 
'Тараз' => 1, 
'Ойтал' => 5, 
'Орнек' => 5, 
'Сарыкемер' => 4, 
'Шайкорык' => 2, 
'Шакпакты' => 5, 
'Шу' => 5,
);
$cities['Западно-Казахстанская область'] = array(
'Аксай' => 3, 
'Аэропорт г. Уральск' => 2, 
'Дарьинск' => 7, 
'Деркул' => 2, 
'Желаево' => 1, 
'Зачаганск' => 2, 
'Каменка (Таскала)' => 7, 
'Каратобе' => 7, 
'Мичурино (ЗКО)' => 2, 
'Переминое' => 7, 
'Подстепное' => 2, 
'Пойма' => 7, 
'Сайхин' => 7, 
'Селекционный' => 2, 
'Серебряково' => 7, 
'Таскала' => 7, 
'Уральск' => 1, 
'Фёдоровка (ЗКО)' => 7, 
'Чапаево' => 7, 
'Чингирлау' => 7, 
'Шипов' => 7, 
'Щапово' => 7,
);
$cities['Карагандинская область'] = array(
'Абай' => 3, 
'Агадырь' => 6, 
'Актас' => 2, 
'Актау' => 7, 
'Балхаш' => 2, 
'Долинка' => 5, 
'Доскей' => 2, 
'Жайрем' => 2, 
'Жамбыл (Кар. обл.)' => 6, 
'Жана-Арка' => 4, 
'Жезказган' => 2, 
'Изумрудный' => 6, 
'Карабас' => 5, 
'Караганда' => 1, 
'Нурказган' => 6, 
'Осакаровка' => 6, 
'Приозёрск' => 6, 
'Сарань' => 3, 
'Сарышаган' => 6, 
'Сатпаев' => 3, 
'Сортировка (пос.)' => 1, 
'Темиртау' => 2, 
'Топар' => 5, 
'Шахан' => 4, 
'Шахтинск' => 3,
);
$cities['Костанайская область'] = array(
'Алтынсарино' => 6, 
'Амангельды' => 5, 
'Аркалык' => 4, 
'Аулиеколь' => 4, 
'Варваринка' => 6, 
'Денисовка' => 5, 
'Жетыгара' => 3, 
'Жетыгаринский рудник' => 5, 
'Заречный' => 1, 
'Затобольск' => 2, 
'Камысты' => 5, 
'Карабалык' => 6, 
'Караменды (Наурзум)' => 5, 
'Карасу' => 3, 
'Качар' => 3, 
'Костанай' => 1, 
'Кушмурун' => 6, 
'Лисаковск' => 2, 
'Мендыгара (Боровское)' => 3, 
'Мичурино (Костанайская обл.)' => 1, 
'Обаган' => 5, 
'Октябрьский' => 5, 
'Рудный -' => 2, 
'Сарыколь' => 3,
'Тарановское' => 5,
'Тобол' => 5,
'Торгай' => 5,
'Узунколь' => 4,
'Фёдоровка' => 5,
);
$cities['Кызылординская область'] = array(
'1-Мамыр' => 6,
'Аральск' => 5,
'Байконур' => 4,
'Белькуль' => 4,
'Жалагаш' => 6,
'Жанакорган' => 6,
'Жосалы' => 6,
'Казалинск' => 6,
'Казгермунай' => 5,
'КБИ' => 2,
'Кызылжарма' => 5,
'Кызыл-Орда' => 1,
'Махамбет' => 5,
'Тасбогет' => 4,
'Теренозек' => 6,
'Титов' => 5,
'Торетам' => 6,
'Шиели' => 6,
);
$cities['Мангыстауская область'] = array(
'Актау' => 1,
'Акжигит' => 6,
'Акшакур' => 2,
'Аташ' => 4,
'Аэропорт г. Актау' => 2,
'Баскудук' => 2,
'Баутино' => 4,
'Бейнеу' => 5,
'Бирлик пос. (Мангистауская обл.)' => 3,
'Боранколь' => 6,
'Бостан' => 5,
'Даулет (Мангистауская обл.)' => 2,
'Жана-Озень' => 3,
'Жетыбай' => 3,
'Куланды' => 5,
'Курык' => 3,
'Кызылсай' => 5,
'Мангыстау ст.' => 2,
'Мунайшы' => 3,
'Сайын' => 2,
'Сенек' => 5,
'Тельман' => 2,
'Тенге' => 5,
'Умирзак' => 2,
'Форт Шевченко' => 4,
'Шетпе' => 4,
);
$cities['Павлодарская область'] = array(
'Акку' => 5,
'Аксу' => 2,
'Актогай' => 5,
'Баянаул' => 5,
'ГРЭС-1, ГРЭС-2' => 4,
'Иртышск' => 5,
'Коктобе' => 5,
'Майкаин' => 5,
'Павлодар' => 1,
'Теренколь' => 5,
'Успенка' => 5,
'Шидерты' => 5,
'Экибастуз' => 1,
);
$cities['Северо-Казахстанская область'] = array(
'Андреевка' => 6,
'Асаново' => 7,
'Аузнар' => 6,
'Бишкуль' => 6,
'Благовещенка' => 6,
'Булаево' => 6,
'Возвышенка' => 7,
'Железное' => 7,
'Ленинское' => 6,
'Мамлютка' => 5,
'Новоишимское' => 6,
'Петропавловск' => 1,
'Покровка' => 6,
'Саумалколь' => 5,
'Смирново' => 6,
'Сокологоловка' => 6,
'Тайынша' => 6,
'Талшык' => 6,
'Токуши' => 5,
'Явленка' => 6,
'Якорь' => 5,
);
$cities['Южно-Казахстанская область'] = array(
'Абай' => 4,
'Аксукент' => 3,
'Арысь' => 4,
'Аэропорт г. Шымкент' => 2,
'Бадам ст.' => 4,
'Кантагы' => 5,
'Кентау' => 5,
'Ленгер' => 3,
'Новый Икан' => 5,
'Сайрам' => 3,
'Сары-Агаш' => 5,
'Созак' => 7,
'Тассай' => 2,
'Таукент' => 7,
'Туркестан' => 5,
'Шолаккорган' => 7,
'Шымкент' => 1,
);


$zones = array();
$zones[0] = 600;
$zones[1] = 1600;
$zones[2] = 1600;
$zones[3] = 2500;
$zones[4] = 2500;
$zones[5] = 3000;
$zones[6] = 3000;
$zones[7] = 7000;